"""
    * A simple calc app
    Написать программу, которая будет задавать пользователю вопросы, и проверять правильность ответов.
Если пользователь неправильно ответил на вопрос, то выводится сообщение, что ответ неверный и вопрос задается повторно.
Программа должна задавать не менее трех вопросов.
Вопросы задаются последовательно.

Задание №2 (сложнее)
Написать “калькулятор“. Пользователь вводит либо числа, либо знаки арифметических действий (+, -, *, /), калькулятор выводит промежуточные ответы.
Первый ввод обязательно число.
Приоритезации операций нет, скобки не обрабатываются.
Окончание работы является ввод пустой строки (т.е. просто нажатие Enter)

Пример:
Введите действие или число:
4
Введите следующее действие или число:
+
Введите следующее действие или число:
4
Промежуточный итог: 8

"""
